Repository: CodeAndWeb/angular-localize-xlf-example
Catalog: src/locale/messages.*.xlf
Languages: de

source: Translation demo!
de: Übersetzungsdemo!

# main.title
source: Title with manual ID
de: Titel mit manueller ID

# main.hello
source: Hello {{name}}!
de: Hallo {{name}}!

# icu.plural
source: There {counter, plural, =0 {are no apples} one {is one apple} other {are {{counter}} apples} } in the basket.
de: Es {ICU} im Korb.

source: {VAR_PLURAL, plural, =0 {are no apples} one {is one apple} other {are {INTERPOLATION} apples}}
de: {VAR_PLURAL, plural, =0 {sind keine Äpfel} one {ist ein Apfel} other {sind {INTERPOLATION} Äpfel}}

# icu.selection
source: There is {fruit, select, apple {one apple} pear {one pear} } in the basket.
de: Es ist {ICU} im Korb.

source: {VAR_SELECT, select, apple {one apple} pear {one pear}}
de: {VAR_SELECT, select, apple {ein Apfel} pear {eine Birne}}

# icu.combined
source: There {counter, plural, =0 {are no {fruit, select, apple {apples} pear {pears}} } one {is one {fruit, select, apple {apple} pear {pear}} } other {are {{counter}} {fruit,select, apple {apples} pear {pears}} } } in the basket.
de: Es {ICU} im Korb.

source: {VAR_PLURAL, plural, =0 {are no {VAR_SELECT, select, apple {apples} pear {pears}} } one {is one {VAR_SELECT_1, select, apple {apple} pear {pear}} } other {are {INTERPOLATION} {VAR_SELECT_2, select, apple {apples} pear {pears}} }}
de: {VAR_PLURAL, plural, =0 {sind keine {VAR_SELECT, select, apple {Äpfel} pear {Birnen} } } one {ist {VAR_SELECT_1, select, apple {ein Apfel} pear {eine Birne} } } other {sind {INTERPOLATION} {VAR_SELECT_2, select, apple {Äpfel} pear {Birnen} } } }

# main.hello-again
source: Hello again!
de: Hallo nochmal!
